[
  {
    "id": 1,
    "title": "AI Resume Screening System with Chatbot Integration",
    "description": "Developing a comprehensive web application to revolutionize recruitment by automating resume screening and enhancing candidate engagement. This system leverages advanced AI/NLP to accurately parse resumes, semantically match candidates to job descriptions, and provide explainable, bias-mitigated scores. It features a proactive, AI-driven chatbot offering real-time resume feedback to candidates before submission, alongside robust HR tools for collaborative evaluation and intelligent insights.",
    "techStack": ["React.js", "Node.js (Express)", "AI/NLP", "MongoDB", "Cloudflare R2", "Auth.js", "Rasa Open Source"],
    "imageSrc": "./assets/resume.jpg",
    "githubLink": "https://github.com/Anvitha-git/ai-resume-screening.git"
  },
  {
    "id": 2,
    "title": "Student Mental Health Analysis (SQL)",
    "description": "An in-depth SQL-based project focused on analyzing student mental health data. This project demonstrates strong database management, advanced querying techniques, and the ability to extract meaningful insights from structured data for sociological and health-related applications.",
    "techStack": ["SQL", "Database Management", "Data Analysis", "MySQL"],
    "imageSrc": "./assets/mental_health_sql.jpg",
    "githubLink": "https://github.com/pranavv1210/Student-Mental-Health-Analysis-SQL.git"
  },
  {
    "id": 4,
    "title": "Document Editor using AI",
    "description": "An innovative AI-powered document editor designed to enhance productivity and content creation. It leverages advanced Natural Language Processing (NLP) and Machine Learning models to offer intelligent features like grammar correction, style suggestions, content summarization, and automated text generation within a user-friendly interface.",
    "techStack": ["AI", "NLP", "Machine Learning", "Python", "Web Development"],
    "imageSrc": "./assets/document_editor_ai.jpg",
    "githubLink": "https://github.com/pranavv1210/Document-Editor-using-AI.git"
  }
]